app/views/libros/_formulario.html.erb

			<th><%= f.label 'Genero' %></th>
			<td><%= f.select :genero_id, @generos.collect{|e| [e.genero,e.descripcion]}, {include_blank: "Selecciona uno."} %></td>
---
SELECT `generos`.* FROM `generos`