app/controllers/carreras_controller.rb

SELECT `carreras`.* FROM `carreras`
---
  def index
    @carreras = Carrera.all

INSERT INTO `carreras` (`clave`, `nombre`, `descripcion`, `campus`, `municipio`, `estado`, `pais`, `coordinador`) VALUES (15002, 'Ingenieria en Computación', 'Sistemas automatizados', 'Facultad de Ingeniería', 'Toluca', 'Estado de México', 'México', 'Marcelo Romero Huertas')
---
  def create
    @carrera = Carrera.new(carrera_params)

    respond_to do |format|
      if @carrera.save

UPDATE `carreras` SET `clave` = 5002 WHERE `carreras`.`id` = 1
---
  def update
    respond_to do |format|
      if @carrera.update(carrera_params)

DELETE FROM `carreras` WHERE `carreras`.`id` = 1
---
  def destroy
    @carrera.destroy

SELECT  `carreras`.* FROM `carreras` WHERE `carreras`.`id` = 1 LIMIT 1
---
    def set_carrera
      @carrera = Carrera.find(params[:id])