app/controllers/coordinadores_controller.rb

UPDATE `coordinadores` SET `nombre` = 'Marcelo ', `direccion` = 'Toluca ', `telefonoCelular` = '5555555555', `especialidad` = 'Servidores' WHERE `coordinadores`.`id` = 1
---
  def actualizar
    @coordinador = Coordinador.find(params[:coordinador][:id])

    respond_to do |format|
      if @coordinador.update(
      correo: params[:coordinador][:correo],
      nombre: params[:coordinador][:nombre],
      paterno: params[:coordinador][:paterno],
      materno: params[:coordinador][:materno],
      direccion: params[:coordinador][:direccion],
      telefonoCelular: params[:coordinador][:telefonoCelular],
      telefonoCasa: params[:coordinador][:telefonoCasa],
      especialidad: params[:coordinador][:especialidad])