app/controllers/edificios_controller.rb

def inicio
    @edificios = Edificio.all
---
SELECT `edificios`.* FROM `edificios`

  def mostrar
    @edificio = Edificio.find(params[:id])
---
SELECT  `edificios`.* FROM `edificios` WHERE `edificios`.`id` = 1 LIMIT 1

  def crear
    @edificio = Edificio.new(
      codigo: params[:edificio][:codigo],
      direccion: params[:edificio][:direccion],
      pagina: params[:edificio][:pagina],
      telefono: params[:edificio][:telefono],
      horaAbre: params[:edificio][:horaAbre],
      horaCierre: params[:edificio][:horaCierre],
      numeroSalones: params[:edificio][:numeroSalones],
      numeroCubiculos: params[:edificio][:numeroCubiculos],
      proveedor_id: params[:edificio][:proveedor_id])
    @proveedores = Proveedor.all

    respond_to do |format|
      if @edificio.save
---
INSERT INTO `edificios` (`codigo`, `direccion`, `pagina`, `telefono`, `horaAbre`, `horaCierre`, `numeroSalones`, `numeroCubiculos`, `proveedor_id`) VALUES ('1001', 'borrar', 'borrar', '1234567890', '00:00', '15:00', 5, 5, 1)

  def editar
    @edificio = Edificio.where('id = ?', params[:id]).first
---
SELECT  `edificios`.* FROM `edificios` WHERE (id = '1') ORDER BY `edificios`.`id` ASC LIMIT 1

  def actualizar
    @edificio = Edificio.find(params[:edificio][:id])

    respond_to do |format|
      if @edificio.update(
      codigo: params[:edificio][:codigo],
      direccion: params[:edificio][:direccion],
      pagina: params[:edificio][:pagina],
      telefono: params[:edificio][:telefono],
      horaAbre: params[:edificio][:horaAbre],
      horaCierre: params[:edificio][:horaCierre],
      numeroSalones: params[:edificio][:numeroSalones],
      numeroCubiculos: params[:edificio][:numeroCubiculos],
      proveedor_id: params[:edificio][:proveedor_id])
---
SELECT  `edificios`.* FROM `edificios` WHERE `edificios`.`id` = 1 LIMIT 1
UPDATE `edificios` SET `direccion` = 'Toluca edición', `horaAbre` = '15:00', `numeroCubiculos` = 10 WHERE `edificios`.`id` = 1

  def eliminar
      @edificio = Edificio.find(params[:id])
      respond_to do |format|
      if @edificio.destroy
---
SELECT  `edificios`.* FROM `edificios` WHERE `edificios`.`id` = 1 LIMIT 1
DELETE FROM `edificios` WHERE `edificios`.`id` = 1