app/controllers/editoriales_controller.rb

  def create
    @editorial = Editorial.new(editorial_params)

    respond_to do |format|
      if @editorial.save
---
INSERT INTO `editoriales` (`nombre`, `tipo`, `isin`, `industria`, `formaLegal`, `fundador`, `sede`, `fundacion`) VALUES ('Grupo Mondadori', 'Large publisher y editorial de libros', 'IT0001469383', 'Editorial', 'Sociedad por acciones', 'Arnoldo Mondadori', 'Segrate Milan, Italia', '2016-01-11')