app/controllers/especialidades_controller.rb

  def nuevo
    @especialidad = Especialidad.new
    @carreras = Carrera.all
---
SELECT `carreras`.* FROM `carreras`

  def crear
    @especialidad = Especialidad.new(
      clave: params[:especialidad][:clave],
      nombre: params[:especialidad][:nombre],
      descripcion: params[:especialidad][:descripcion],
      carrera_id: params[:especialidad][:carrera_id])
    @carreras = Carrera.all

    respond_to do |format|
      if @especialidad.save
---
SELECT `carreras`.* FROM `carreras`
INSERT INTO `especialidades` (`clave`, `nombre`, `descripcion`, `carrera_id`) VALUES (2021, 'Redes ', 'Expertos en redes', 1)

  def editar
    @especialidad = Especialidad.where('id = ?', params[:id]).first
    @carreras = Carrera.all
---
SELECT `carreras`.* FROM `carreras`

  def actualizar
    @especialidad = Especialidad.find(params[:especialidad][:id])
    @carreras = Carrera.all

    respond_to do |format|
      if @especialidad.update(
        clave: params[:especialidad][:clave],
        nombre: params[:especialidad][:nombre],
        descripcion: params[:especialidad][:descripcion],
        carrera_id: params[:especialidad][:carrera_id])
---
UPDATE `especialidades` SET `nombre` = 'Desarrollo de software', `descripcion` = 'Expertos en software' WHERE `especialidades`.`id` = 1

  def eliminar
      @especialidad = Especialidad.find(params[:id])
      respond_to do |format|
      if @especialidad.destroy
---
DELETE FROM `especialidades` WHERE `especialidades`.`id` = 1