app/controllers/generos_controller.rb

  def index
    @generos = Genero.all
---
SELECT `generos`.* FROM `generos`

  def create
    @genero = Genero.new(genero_params)

    respond_to do |format|
      if @genero.save
---
INSERT INTO `generos` (`genero`, `subgenero`, `descripcion`, `semantica`, `sintactica`, `fonologia`, `contexto`, `historia`) VALUES ('Novela', 'Magic realist fiction', 'Es considerada una obra maestra de la literatura hispanoamericana y universal', 'Lingüistica', 'Morfema', 'Alófono', 'Forma de prosa', 'La novela es el reino de la libertad de contenido y de forma.')

  def update
    respond_to do |format|
      if @genero.update(genero_params)
---
UPDATE `generos` SET `genero` = 'Novela', `subgenero` = 'Narracion', `descripcion` = 'Genero literario', `semantica` = 'prueba', `sintactica` = 'prueba', `fonologia` = 'prueba', `contexto` = 'Este es un contexto', `historia` = 'Siglo XVI' WHERE `generos`.`id` = 1

  def destroy
    respond_to do |format|
      if @genero.destroy
---
DELETE FROM `generos` WHERE `generos`.`id` = 3

    def set_genero
      @genero = Genero.find(params[:id])
---
SELECT  `generos`.* FROM `generos` WHERE `generos`.`id` = 1 LIMIT 1