app/controllers/idiomas_controller.rb

SELECT `idiomas`.* FROM `idiomas`
---
  def index
    @idiomas = Idioma.all

INSERT INTO `idiomas` (`nombre`, `region`, `hablantes`, `puesto`, `familia`, `dialectos`, `escritura`, `reguladoPor`) VALUES ('Español', 'España,Hispanoamérica,Guinea Ecuatorial', 586000000, 4, 'Latino-falisco-Romance', 'Amazonico, centroamericano, andino', 'Alfabeto latino, braile español', 'Asociación de Academias de la Lengua Española')
---
  def create
    @idioma = Idioma.new(idioma_params)

    respond_to do |format|
      if @idioma.save

UPDATE `idiomas` SET `nombre` = 'Español', `region` = 'España, hispanoamerica', `hablantes` = 100000, `puesto` = 4, `familia` = 'Romance', `dialectos` = 'catalán', `escritura` = 'alfabeto latino' WHERE `idiomas`.`id` = 1
---
  def update
    respond_to do |format|
      if @idioma.update(idioma_params)

DELETE FROM `idiomas` WHERE `idiomas`.`id` = 1
---
  def destroy
    @idioma.destroy

SELECT  `idiomas`.* FROM `idiomas` WHERE `idiomas`.`id` = 1 LIMIT 1
---
    def set_idioma
      @idioma = Idioma.find(params[:id])