app/controllers/libros_controller.rb

SELECT `libros`.* FROM `libros`
---
  def inicio
    @libros = Libro.all

SELECT  `libros`.* FROM `libros` WHERE `libros`.`id` = 1 LIMIT 1
---
  def mostrar
    @libro = Libro.find(params[:id])

SELECT `generos`.* FROM `generos`
SELECT `idiomas`.* FROM `idiomas`
---
  def nuevo
    @libro = Libro.new
    @autores = Autor.all
    @editoriales = Editorial.all
    @generos = Genero.all
    @idiomas = Idioma.all

INSERT INTO `libros` (`isbn`, `titulo`, `autor_id`, `editorial_id`, `genero_id`, `idioma_id`) VALUES ('9788423919001', 'El coronel no tiene quien le escirba', 1, 1, 1, 1)
---
  def crear
    @libro = Libro.new(
      isbn: params[:libro][:isbn],
      titulo: params[:libro][:titulo],
      autor_id: params[:libro][:autor_id],
      editorial_id: params[:libro][:editorial_id],
      genero_id: params[:libro][:genero_id],
      idioma_id: params[:libro][:idioma_id]
      )

    respond_to do |format|
      if @libro.save

SELECT  `libros`.* FROM `libros` WHERE (id = '1') ORDER BY `libros`.`id` ASC LIMIT 1
SELECT `generos`.* FROM `generos`
SELECT `idiomas`.* FROM `idiomas`
---
  def editar
    @libro = Libro.where('id = ?', params[:id]).first
    @autores = Autor.all
    @editoriales = Editorial.all
    @generos = Genero.all
    @idiomas = Idioma.all

SELECT  `libros`.* FROM `libros` WHERE (id = '1') ORDER BY `libros`.`id` ASC LIMIT 1
UPDATE `libros` SET `isbn` = '9788423919000', `titulo` = 'Cien años de soledad' WHERE `libros`.`id` = 1
---
  def actualizar
    @libro = Libro.find(params[:libro][:id])

    respond_to do |format|
      if @libro.update(
        isbn: params[:libro][:isbn],
        titulo: params[:libro][:titulo],
        autor_id: params[:libro][:autor_id],
        editorial_id: params[:libro][:editorial_id],
        genero_id: params[:libro][:genero_id],
        idioma_id: params[:libro][:idioma_id]
      )

SELECT  `libros`.* FROM `libros` WHERE `libros`.`id` = 1 LIMIT 1
DELETE FROM `libros` WHERE `libros`.`id` = 1
---
  def eliminar
      @libro = Libro.find(params[:id])
      respond_to do |format|
      if @libro.destroy