app/controllers/personas_controller.rb

  def inicio
    @personas = Persona.all
---
SELECT `personas`.* FROM `personas`

  def mostrar
    @persona = Persona.find(params[:id])
---
SELECT  `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1

  def crear
    @persona = Persona.new(
      curp: params[:persona][:curp],
      nombre: params[:persona][:nombre],
      paterno: params[:persona][:paterno],
      materno: params[:persona][:materno],
      sexo: params[:persona][:sexo],
      telefono: params[:persona][:telefono],
      direccion: params[:persona][:direccion],
      password_digest: params[:persona][:password_digest],
      rol_id: params[:persona][:rol_id],
      especialidad_id: params[:persona][:especialidad_id]
      )

    respond_to do |format|
      if @persona.save
---
INSERT INTO `personas` (`curp`, `nombre`, `paterno`, `materno`, `sexo`, `telefono`, `direccion`, `password_digest`, `rol_id`, `especialidad_id`) VALUES ('MEAJ930109HMCNRR03', 'Juan', 'Baez', 'Fernandez', 'H', '0987654321', 'Zinacantepec', '12345', 2, 1)

  def editar
    @persona = Persona.where('id = ?', params[:id]).first
---
SELECT  `personas`.* FROM `personas` WHERE (id = '1') ORDER BY `personas`.`id` ASC LIMIT 1

  def actualizar
    @persona = Persona.find(params[:persona][:id])

    respond_to do |format|
      if @persona.update(
        curp: params[:persona][:curp],
        nombre: params[:persona][:nombre],
        paterno: params[:persona][:paterno],
        materno: params[:persona][:materno],
        sexo: params[:persona][:sexo],
        telefono: params[:persona][:telefono],
        direccion: params[:persona][:direccion],
        password_digest: params[:persona][:password_digest],
        rol_id: params[:persona][:rol_id],
        especialidad_id: params[:persona][:especialidad_id]
      )
---
SELECT  `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
UPDATE `personas` SET `curp` = 'MEAJ930109HMCNRR01', `nombre` = 'Jairosadñfjdñlfj' WHERE `personas`.`id` = 1

  def eliminar
    @persona = Persona.find(params[:id])
      respond_to do |format|
      if @persona.destroy
---
SELECT  `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
DELETE FROM `personas` WHERE `personas`.`id` = 1