app/controllers/prestamos_controller.rb

SELECT `prestamos`.* FROM `prestamos`
---
  def inicio
    @prestamos = Prestamo.all

SELECT  `prestamos`.* FROM `prestamos` WHERE `prestamos`.`id` = 1 LIMIT 1
---
  def mostrar
    @prestamo = Prestamo.find(params[:id])

SELECT `libros`.* FROM `libros`
SELECT `personas`.* FROM `personas`
---
  def nuevo
    @prestamo = Prestamo.new
    @libros = Libro.all
    @personas = Persona.all

SELECT `libros`.* FROM `libros`
SELECT `personas`.* FROM `personas`
INSERT INTO `prestamos` (`fechaPrestamo`, `horaPrestamo`, `tipo`, `fechaEntrega`, `horaEntrega`, `libro_id`, `persona_id`) VALUES ('2020-01-01', '12:00', 'kjgj', '2020-01-01', '13:00', 1, 1)
---
  def crear
    @prestamo = Prestamo.new(
      fechaPrestamo: params[:prestamo][:fechaPrestamo],
      horaPrestamo: params[:prestamo][:horaPrestamo],
      tipo: params[:prestamo][:tipo],
      fechaEntrega: params[:prestamo][:fechaEntrega],
      horaEntrega: params[:prestamo][:horaEntrega],
      libro_id: params[:prestamo][:libro_id],
      persona_id: params[:prestamo][:persona_id]
      )
    @libros = Libro.all
    @personas = Persona.all

    respond_to do |format|
      if @prestamo.save

SELECT  `prestamos`.* FROM `prestamos` WHERE (id = '1') ORDER BY `prestamos`.`id` ASC LIMIT 1
SELECT `libros`.* FROM `libros`
SELECT `personas`.* FROM `personas`
---
  def editar
    @prestamo = Prestamo.where('id = ?', params[:id]).first
    @libros = Libro.all
    @personas = Persona.all

SELECT  `prestamos`.* FROM `prestamos` WHERE `prestamos`.`id` = 1 LIMIT 1
UPDATE `prestamos` SET `fechaPrestamo` = '2020-01-03', `horaPrestamo` = '07:50', `fechaEntrega` = '2020-01-05', `horaEntrega` = '19:50' WHERE `prestamos`.`id` = 1
---
  def actualizar
    @prestamo = Prestamo.find(params[:prestamo][:id])
    @libros = Libro.all
    @personas = Persona.all

    respond_to do |format|
      if @prestamo.update(
        fechaPrestamo: params[:prestamo][:fechaPrestamo],
        horaPrestamo: params[:prestamo][:horaPrestamo],
        tipo: params[:prestamo][:tipo],
        fechaEntrega: params[:prestamo][:fechaEntrega],
        horaEntrega: params[:prestamo][:horaEntrega],
        libro_id: params[:prestamo][:libro_id],
        persona_id: params[:prestamo][:persona_id]
      )

SELECT  `prestamos`.* FROM `prestamos` WHERE `prestamos`.`id` = 1 LIMIT 1
DELETE FROM `prestamos` WHERE `prestamos`.`id` = 1
---
  def eliminar
    @prestamo = Prestamo.find(params[:id])
      respond_to do |format|
      if @prestamo.destroy