app/controllers/presidentes_controller.rb

def inicio
    @presidentes = Presidente.all
---
SELECT `presidentes`.* FROM `presidentes`

  def mostrar
    @presidente = Presidente.find(params[:id])
---
SELECT  `presidentes`.* FROM `presidentes` WHERE `presidentes`.`id` = 1 LIMIT 1

  def crear
    @presidente = Presidente.new(
      predecesor: params[:presidente][:predecesor],
      nacimiento: params[:presidente][:nacimiento],
      residencia: params[:presidente][:residencia],
      nacionalidad: params[:presidente][:nacionalidad],
      religion: params[:presidente][:religion],
      educadoEn: params[:presidente][:educadoEn],
      ocupacion: params[:presidente][:ocupacion],
      distinciones: params[:presidente][:distinciones])

    respond_to do |format|
      if @presidente.save
---
INSERT INTO `presidentes` (`predecesor`, `nacimiento`, `residencia`, `nacionalidad`, `religion`, `educadoEn`, `ocupacion`, `distinciones`) VALUES ('GOB', '1950-01-01', 'CDMX', 'Mexicano', 'Cristiano', 'UAEMEX', 'Empresario,Arquitecto', 'Ninguna')

  def editar
    @presidente = Presidente.where('id = ?', params[:id]).first
---
SELECT  `presidentes`.* FROM `presidentes` WHERE (id = '1') ORDER BY `presidentes`.`id` ASC LIMIT 1

  def actualizar
    @presidente = Presidente.find(params[:presidente][:id])

    respond_to do |format|
      if @presidente.update(
      predecesor: params[:presidente][:predecesor],
      nacimiento: params[:presidente][:nacimiento],
      residencia: params[:presidente][:residencia],
      nacionalidad: params[:presidente][:nacionalidad],
      religion: params[:presidente][:religion],
      educadoEn: params[:presidente][:educadoEn],
      ocupacion: params[:presidente][:ocupacion],
      distinciones: params[:presidente][:distinciones])
---
SELECT  `presidentes`.* FROM `presidentes` WHERE `presidentes`.`id` = 1 LIMIT 1
UPDATE `presidentes` SET `predecesor` = 'Carlos Slim', `nacionalidad` = 'Mexicano edición' WHERE `presidentes`.`id` = 1

  def eliminar
      @presidente = Presidente.find(params[:id])
      respond_to do |format|
      if @presidente.destroy
---
SELECT  `presidentes`.* FROM `presidentes` WHERE `presidentes`.`id` = 1 LIMIT 1
DELETE FROM `presidentes` WHERE `presidentes`.`id` = 1