app/controllers/proveedores_controller.rb

SELECT `presidentes`.* FROM `presidentes`
---
  def nuevo
    @proveedor = Proveedor.new
    @presidentes = Presidente.all

SELECT `presidentes`.* FROM `presidentes`
---
  def editar
    @proveedor = Proveedor.where('id = ?', params[:id]).first
    @presidentes = Presidente.all

UPDATE `proveedores` SET `tipo` = 'Sector privado edición', `industria` = 'Telmex edición', `matriz` = 'America Movil edición' WHERE `proveedores`.`id` = 1
---
  def actualizar
    @proveedor = Proveedor.find(params[:proveedor][:id])

    respond_to do |format|
      if @proveedor.update(
      codigo: params[:proveedor][:codigo],
      tipo: params[:proveedor][:tipo],
      industria: params[:proveedor][:industria],
      formaLegal: params[:proveedor][:formaLegal],
      fundacion: params[:proveedor][:fundacion],
      servicio: params[:proveedor][:servicio],
      matriz: params[:proveedor][:matriz],
      sitioweb: params[:proveedor][:sitioweb],
      empleados: params[:proveedor][:empleados],
      presidente_id: params[:proveedor][:presidente_id])