app/controllers/roles_controller.rb

SELECT `edificios`.* FROM `edificios`
---
  def nuevo
    @rol = Rol.new
    @edificios = Edificio.all

SELECT `edificios`.* FROM `edificios`
---
  def editar
    @rol = Rol.where('id = ?', params[:id]).first
    @edificios = Edificio.all

UPDATE `roles` SET `rol` = 'Estudiante matutino', `descripcion` = 'Toma clases de 7 a 9 am' WHERE `roles`.`id` = 2
---
  def actualizar
    @rol = Rol.find(params[:rol][:id])
    @edificios = Edificio.all
    respond_to do |format|
      if @rol.update(rol: params[:rol][:rol],
      descripcion: params[:rol][:descripcion],
      zonaEstacionamiento: params[:rol][:zonaEstacionamiento],
      fechaIngreso: params[:rol][:fechaIngreso],
      horaIngreso: params[:rol][:horaIngreso],
      edificio_id: params[:rol][:edificio_id],)