app/controllers/sesiones_controller.rb

SELECT  `personas`.* FROM `personas` WHERE (curp = 'MEAJ930109HMCNRR02' and password_digest = NULL) ORDER BY `personas`.`id` ASC LIMIT 1
---
  def validar_usuario
  	@persona = Persona.where('curp = ? and password_digest = ?',
  		params[:curp], params[:password_digest]).first